Revit 2026 API

# TileTextureLinkTextureTransforms Property

---

The property labeled "Link Transforms" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureLinkTextureTransforms { get; }
```
```vb
Public Shared ReadOnly Property TextureLinkTextureTransforms As String
	Get
```
```cpp
public:
static property String^ TextureLinkTextureTransforms {
	String^ get ();
}
```
```fsharp
static member TextureLinkTextureTransforms : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace